const String kOnboardingImage = "assets/images/onboarding.png";
const String kDefaultImage = "assets/images/logo.png";
const double kBorderRadius = 12.0;

// failures messages
const String kServerFailureMessage = "Please try again later";
const String kEmptyFailureMessage = "No data";
const String kOfflineFailureMessage = "Please check your internet connection";
const String kWrongFieldFailureMessage = "Some Fields are missing or invalid";
const String kUserExistFailureMessage =
    "this user is already exists, you can login instead";
const String kWrongUserOrPasswordFailureMessage =
    "Please check your username and password";

const String kSuccess = "success";

// api consts
const String kBaseUrl = "https://todo.iraqsapp.com";
const String kImagesUrl = "$kBaseUrl/images";

// secure storage keys
const String kId = "_id";
const String kDisplayName = "displayName";
const String kRefreshToken = "refresh_token";
const String kAccessToken = "access_token";

// sentences
const List<String> success_words = [
  "نور الله قلبك",
  "رعاك الله",
  "وفقك الله",
  " عمر قلبك بالإيمان",
  "عين الله تحرسك",
  "إجابتك دليل تفوقك",
  "أحسنت",
  "سلمت يداك",
  "بارك الله فيك",
  "ممتاز .. ",
  "حماك الله",
  "جهود مباركة",
  "مجهود طيب",
  "إجابتك موفقة",
  "رعاك الرحمن",
  "بوركت",
  " رائع ",
  "ممتاز "
];

const List<String> success_messages = [
  "ليس هناك من هو أكثر بؤسا من المرء الذي أصبح اللا قرار هو عادته الوحيدة",
  "إذا لم تحاول أن تفعل شيء أبعد مما قد أتقنته ، فإنك لا تتقدم أبدا",
  "عندما أقوم ببناء فريق فإني أبحث دائما عن أناس يحبون الفوز ويكرهون الهزيمة",
  "إن أعظكم اكتشاف لجيلي هو أن الإنسان يمكن أن يغير حياته إذا ما استطاع أن يغير اتجاهاته العقلية",
  "إن المرء هو أصل كل ما يفعل",
  "يجب أن تثق بنفسك لأنك أقوى مما تظن",
  "يجب أن تثق بنفسك وإذا لم تثق بنفسك فمن ذا الذي سيثق بك",
  "إن ما تحصل عليه من دون جهد أو ثمن ليس له قيمة",
  "إذا لم تفشل فأنت لم تعمل بجد",
  "عليك أن تفعل الأشياء التي تعتقد أنه ليس باستطاعتك أن تفعلها",
  "من يعش في خوف لن يكون حرا أبدا",
  "الرجل العظيم يكون مطمئنا ، يتحرر من القلق ، بينما الرجل ضيق الأفق فعادة ما يكون متوترا",
  "إن الاتصال في العلاقات الإنسانية يتشابه بالتنفس للإنسان ، كلاهما يهدف إلى استمرار الحياة",
  "رحلة الألف ميل تبدأ بخطوة",
  "العمل الشاق لا يذهب أبدا بدون مكافأة",
  "لا شيء يجب أن يمنعك من تسلق المرتفعات العليا",
  "النجاح هو مجموع الجهود الصغيرة التي تتكرر يوما بعد يوم",
  "ليست هنالك أسرار للنجاح، فهو حصيلة الإعداد الجيد والعمل الشاق",
  "مثابرتك واجتهادك سوف يساعدك على النجاح والتفوق",
  "لن يستطيع أحد أن يحتكر النجاح لنفسه، فالنجاح ملك من يدفع ثمنه",
  "ثمرة النجاح تأتي من الصبر الطويل",
  "لكل شيء ثمن، وثمن النجاح هو الاجتهاد والإرادة",
  "لا يحتوي قاموس النجاح على كلمة مستحيل",
  "النجاح ليس نهاية الطريق بل محطة عابرة في رحلتك إلى القمة",
  "تذكر دائما أن أكبر الانتصارات تأتي بعد أصعب المعارك",
  "الخطوة الأولى نحو النجاح هي المخاطرة",
  "العمل الشاق والتفاني هما المفتاحان لفتح أبواب النجاح",
  "النجاح لا يأتي لأولئك الين ينتظرون، بل لأولئك الذين يسعون وراءه بشغف",
  "تعامل مع الفشل كفرصة للتعلم وليس كنهاية الطريق",
  "استمر في المحاولة حتى تصل إلى هدفك، فالنجاح ينتظر الذين يثابرون",
  "لا تدع الشكوى والتشاؤم يحجبان رؤيتك",
  "أنت تملك القوة لتحقيق المستحيل",
  "كن واثقا بقدراتك ولا تقلل من قيمتك",
  "اعمل بجد واستمتع بما تقوم به",
  "الشغف هو مصدر الإلهام والنجاح",
  "النجاح ليس مجرد وجهة، بل هو رحلة تستمتع بها وتنمو خلالها",
  "اجعل الإيجابية والشكر هما عادتك اليومية، فالتفاؤل هو السر",
  "كن قويا واستعد لتحقيق أكبر إنجازاتك",
  "العمل الجاد هو المفتاح لتحقيق أحلامك",
  "كل يوم جديد هو فرصة لتكون أفضل من يوم أمس",
  "تفان في عملك وستحصد النجاحات التي لا تحصى",
  "استمر في العمل بإصرار وتصميم وستصل إلى القمة",
  "لا تدع الصعاب تثنيك بل استخدمها كدافع لتحقيق أهدافك",
  "اجعل كل يوم حافلا بالتحديات وفرص التطور",
  "استثمر وقتك وجهودك فيما تحب وستنعم بالرضا والنجاح",
  "الإصرار والتحمل هما مفتاحا النجاح في أي مجال تختاره",
  "اعمل بذكاء واستمتع بما تفعل، وستكون نتائجك مدهشة",
  "العمل الجماعي هو الطريقة الأكثر فاعلية لتحقيق الأهداف الكبيرة",
  "تذكر أن الاستمرارية هي سر النجاح في أي مشروع تقوم به",
  "التخطيط والتنظيم هما أساس العمل الناجح",
  "استفد من أخطائك وتعلم منها ولا تيأس في وجه التحديات",
  "استمر في النمو وتطوير مهاراتك وستتجاوز حدودك الحالية",
  "احتفظ برؤيتك الواضحة لأهدافك، وستجد طريقك نحو تحقيقها",
  "اعمل بذكاء وانضباط وستجني ثمار جهودك",
  "النجاح يأتي من العمل الجاد والصبر والثقة بالنفس",
  "العمل الشاق هو السلم الذي تصعد عليه نحو النجاح",
  "استثمر وقتك بحكمة وتحكم في مصيرك",
  "التحفيز الحقيقي يأتي من الشغف بما تقوم به",
  "تخطي حدودك الحالية وتحدي نفسك لتحقيق المزيد",
  "تذكر أن كل عمل صغير يقربك خطوة أخرى للوصول إلى هدفك الكبير",
  "اعتبر الفشل خطوة للتعلم واستخدمه كفرصة للتحسن",
  "استمتع بما تفعله وستكون الطاقة والحماس هما وقودك الدائم",
  "لا تدع العثرات تثنيك ، بل استخدمها لبناء قوتك وإصرارك",
  "تفائل واعمل بتصميم ، فالتفكير الإيجابي يفتح الأبواب للفرص الكبيرة",
  "تصرف كما لو أنه من المستحيل أن تفشل",
  "إذا كنت تستطيع تخيل صورة ما، يمكنك أن تجعلها واقعا",
  "إذا كنت تستطيع أن تحلم ، يمكنك أن تحقق حلمك",
  "المنافسة الحقيقية دائما ما تكون بين ما تقوم بعمله وما أنت قادر على عمله",
  "إنك تقيس نفسك مع نفسك وليس مع أي شخص آخر",
  "إذا كنت ستهتم لكل ما يقوله الآخر فسوف تصبح أسيرا لديهم",
  "لا تستمد تقديرك لذاتك من شخص آخر وكن مستقلا بذاتك",
  "الحياة مستمرة سواء ضحكت أم بكيت ، فلا تحمل نفسك هموما لن تستفيد منها ، وابتسم",
  "إن الأفكار الإيجابية تعطي أفكار إيجابية ، والأفكار السلبية تعطي أفكار سلبية",
  "مقدار الوقت الذي تقضيه في التدريب ليس هو المهم بالضرورة ، المهم هو ما تبذله من جهد في التدريب",
  "رائع أن تصمت في مكان تضج فيه الأصوا ، والأروع أن يكون صمتك حكمة وليس سلبية",
  "إذا تمالكت أعصابك في لحظة غضب واحدة ستوفر على نفسك أياما من الحزن والندم",
  "لا تقل أبدا أني سوف أفشل ، فإن عقلك الباطن لا يأخذ الأمر بشكل هزلي ، بل إنه يشرع فورا بتحقيقه",
  "قمة المجد ليست في عدم الإخفاق والفشل ، بل في القيام بعد كل عثرة",
  "أنا أسير ببطء ، لكن أبدا لا أسير إلى الخلف",
  "ليس خطوة واحدة عملاقة التي حققت الإنجاز ، إنما مجموعة خطوات صغيرة",
  "فليكن هدفك بلوغ القمر ، حتى إن فشلت في الوصول إليه ستحط بين النجوم",
  "الفرق بين الإنسان الناجح والآخرين هو ليس نقص القوة ولا نقص المعرفة ، إنما نقص الإرادة",
  "النجاح لا يمكن أن يبدأ من الأسبوع القادم ، إنما اليوم",
  "إنك ببساطة لا تستطيع أن تهزم الشخص الذي لا يستسلم",
  "عندما تصل إلى عمق معنى كلمة النجاح ، تجد أنها ببساطة تعني الإصرار",
  "الحماس هو الوقود الذي يحرك المحرك",
  "هناك دائما مكان في القمة",
  "لا تتخلى عن أحلامك ، المعجزات تحدث كل يوم",
  "أنا مصمم على بلوغ الهدف ، فإما أن أنجح ... وإما أن أنجح",
  "أنا لا أرى أبدا ما تم إنجازه ، أنا أرى ما لم يتم إنجازه بعد",
  "في لفظة القمة شيء يقول لك قُم",
  "إذا استطعت العثور على طريق خال من المعوقات فهو غالبا لا يؤدي إلى أي مكان",
  "عليك أن تفعل الأشياء التي تعتقد أنه ليس باستطاعتك أن تفعلها",
  "ما الفشل إلا هزيمة مؤقتة تخلق لك فرص النجاح",
  "لا يوجد إنسان ضعيف ، بل يوجد إنسان يجهل موطن قوته",
  "بدل أن تلعن الظلام ، أوقد شمعة",
  "ما يدركه ويؤمن به عقل الإنسان يمكنه أن يحققه",
  "يرى المتشائم الصعوبة في كل فرصة ، أما المتفائل فيرى الفرصة في كل صعوبة",
  "كن عالي الهمة ولا ترضى بغير القمة",
  "إن الإجابة الوحيدة على الهزيمة هي الانتصار",
  "ربما تفشل إذا خاطرت ، ولكن من المؤكد أنك ستفشل إذا لم تخاطر",
  "إذا قررت وفكرت وخططت وقمت بالفعل فلن يكون هناك مستحيل",
  "العالم بأسره يتنحى جانبا ليفسح الطريق للإنسان الذي يعرف تماما إلى أين يتوجه",
  "حلمك ليس له تاريخ انتهاء ، خذ نفسا عميقا وحاول مرة أخرى"
];
